cf_billing/DataProcessors/бестРаботаСДолжникамиЮЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестРаботаСДолжникамиЮЛ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоМесяцамЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоМесяцамЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоАвансовымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоАвансовымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестРеструктуризированнаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестРеструктуризированнаяЗадолженность</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестСписаннаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестСписаннаяЗадолженность</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СписаниеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестМораторнаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестМораторнаяЗадолженность</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкиКатегорийДебитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкиКатегорийДебитора</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>От</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>До</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДебитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииДебитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/бестВзаиморасчетыПоПениЭЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бестВзаиморасчетыПоПениЭЭ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDСтрокиОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестПлатежныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/бестВидыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестВидыРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Авансовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фактический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пеня</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/бестКатегорииЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестКатегорииЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неоплаченная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сомнительная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просроченная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/бестРаботаСДолжникамиЮЛ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТекстЗапросаДляЗаполнения() Экспорт
	
	Возврат "ВЫБРАТЬ
	        |	бестВзаиморасчетыПоМесяцамЭЭОстатки.Организация КАК Организация,
	        |	бестВзаиморасчетыПоМесяцамЭЭОстатки.Район КАК Район,
	        |	бестВзаиморасчетыПоМесяцамЭЭОстатки.Договор КАК Договор,
	        |	бестВзаиморасчетыПоМесяцамЭЭОстатки.СуммаОстаток КАК Сумма,
	        |	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(бестПлатежныйДокумент.Дата, ДЕНЬ), &Период, ДЕНЬ) КАК КолвоДнейЗадолженности,
	        |	бестПлатежныйДокумент.Дата КАК ДатаВозникновенияЗадолженности
	        |ПОМЕСТИТЬ Задолженность
	        |ИЗ
	        |	РегистрНакопления.бестВзаиморасчетыПоМесяцамЭЭ.Остатки(
	        |			&Период,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестВзаиморасчетыПоМесяцамЭЭОстатки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ПО бестВзаиморасчетыПоМесяцамЭЭОстатки.Договор = энргДоговорыКонтрагентов.Ссылка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	        |		ПО бестВзаиморасчетыПоМесяцамЭЭОстатки.ПлатежныйДокумент = бестПлатежныйДокумент.Ссылка
	        |ГДЕ
	        |	энргДоговорыКонтрагентов.Ссылка = &Договор
	        |	И энргДоговорыКонтрагентов.Статус = &Статус
	        |	И энргДоговорыКонтрагентов.ОтветственныйЗаДоговор = &ОтветственныйЗаДоговор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаПриход - бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаРасход КАК Сумма,
	        |	бестПлатежныйДокумент.Процент КАК Процент,
	        |	ДЕНЬ(бестПлатежныйДокумент.Дата) КАК ДеньФормирования,
	        |	бестВзаиморасчетыПоАвансовымСчетамОбороты.Договор КАК Договор,
	        |	бестВзаиморасчетыПоАвансовымСчетамОбороты.Организация КАК Организация,
	        |	бестВзаиморасчетыПоАвансовымСчетамОбороты.Район КАК Район
	        |ПОМЕСТИТЬ АвансоваяЗадолженность
	        |ИЗ
	        |	РегистрНакопления.бестВзаиморасчетыПоАвансовымСчетам.Обороты(
	        |			&НачалоПериода,
	        |			,
	        |			,
	        |			(Организация, Район, Договор) В
	        |				(ВЫБРАТЬ
	        |					Задолженность.Организация КАК Организация,
	        |					Задолженность.Район КАК Район,
	        |					Задолженность.Договор КАК Договор
	        |				ИЗ
	        |					Задолженность КАК Задолженность)) КАК бестВзаиморасчетыПоАвансовымСчетамОбороты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокументФакт
	        |		ПО бестВзаиморасчетыПоАвансовымСчетамОбороты.Организация = бестПлатежныйДокументФакт.Организация
	        |			И бестВзаиморасчетыПоАвансовымСчетамОбороты.Район = бестПлатежныйДокументФакт.Район
	        |			И бестВзаиморасчетыПоАвансовымСчетамОбороты.Договор = бестПлатежныйДокументФакт.Договор
	        |			И бестВзаиморасчетыПоАвансовымСчетамОбороты.ПериодНачисления = бестПлатежныйДокументФакт.ПериодНачисления
	        |			И (бестПлатежныйДокументФакт.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический))
	        |			И (НЕ бестПлатежныйДокументФакт.ПометкаУдаления)
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестПлатежныйДокумент КАК бестПлатежныйДокумент
	        |		ПО бестВзаиморасчетыПоАвансовымСчетамОбороты.ПлатежныйДокумент = бестПлатежныйДокумент.Ссылка
	        |ГДЕ
	        |	бестПлатежныйДокументФакт.Ссылка ЕСТЬ NULL
	        |	И бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаПриход > бестВзаиморасчетыПоАвансовымСчетамОбороты.СуммаРасход
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестРеструктуризированнаяЗадолженностьОбороты.Организация КАК Организация,
	        |	бестРеструктуризированнаяЗадолженностьОбороты.Район КАК Район,
	        |	бестРеструктуризированнаяЗадолженностьОбороты.Договор КАК Договор,
	        |	СУММА(бестРеструктуризированнаяЗадолженностьОбороты.СуммаОборот) КАК Сумма
	        |ПОМЕСТИТЬ РеструктуризированнаяЗадолженность
	        |ИЗ
	        |	РегистрНакопления.бестРеструктуризированнаяЗадолженность.Обороты(
	        |			,
	        |			&Период,
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестРеструктуризированнаяЗадолженностьОбороты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ПО бестРеструктуризированнаяЗадолженностьОбороты.Договор = энргДоговорыКонтрагентов.Ссылка
	        |ГДЕ
	        |	энргДоговорыКонтрагентов.Ссылка = &Договор
	        |	И энргДоговорыКонтрагентов.Статус = &Статус
	        |	И энргДоговорыКонтрагентов.ОтветственныйЗаДоговор = &ОтветственныйЗаДоговор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестРеструктуризированнаяЗадолженностьОбороты.Организация,
	        |	бестРеструктуризированнаяЗадолженностьОбороты.Район,
	        |	бестРеструктуризированнаяЗадолженностьОбороты.Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестСписаннаяЗадолженностьОбороты.Организация КАК Организация,
	        |	бестСписаннаяЗадолженностьОбороты.Район КАК Район,
	        |	бестСписаннаяЗадолженностьОбороты.Договор КАК Договор,
	        |	СУММА(бестСписаннаяЗадолженностьОбороты.СуммаОборот) КАК Сумма
	        |ПОМЕСТИТЬ СписаннаяЗадолженность
	        |ИЗ
	        |	РегистрНакопления.бестСписаннаяЗадолженность.Обороты(
	        |			,
	        |			&Период,
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестСписаннаяЗадолженностьОбороты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ПО бестСписаннаяЗадолженностьОбороты.Договор = энргДоговорыКонтрагентов.Ссылка
	        |ГДЕ
	        |	энргДоговорыКонтрагентов.Ссылка = &Договор
	        |	И энргДоговорыКонтрагентов.Статус = &Статус
	        |	И энргДоговорыКонтрагентов.ОтветственныйЗаДоговор = &ОтветственныйЗаДоговор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестСписаннаяЗадолженностьОбороты.Организация,
	        |	бестСписаннаяЗадолженностьОбороты.Район,
	        |	бестСписаннаяЗадолженностьОбороты.Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестМораторнаяЗадолженностьОбороты.Организация КАК Организация,
	        |	бестМораторнаяЗадолженностьОбороты.Район КАК Район,
	        |	бестМораторнаяЗадолженностьОбороты.Договор КАК Договор,
	        |	СУММА(бестМораторнаяЗадолженностьОбороты.СуммаОборот) КАК Сумма
	        |ПОМЕСТИТЬ МораторнаяЗадолженность
	        |ИЗ
	        |	РегистрНакопления.бестМораторнаяЗадолженность.Обороты(
	        |			,
	        |			&Период,
	        |			,
	        |			Организация = &Организация
	        |				И Район = &Район) КАК бестМораторнаяЗадолженностьОбороты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	        |		ПО бестМораторнаяЗадолженностьОбороты.Договор = энргДоговорыКонтрагентов.Ссылка
	        |ГДЕ
	        |	энргДоговорыКонтрагентов.Ссылка = &Договор
	        |	И энргДоговорыКонтрагентов.Статус = &Статус
	        |	И энргДоговорыКонтрагентов.ОтветственныйЗаДоговор = &ОтветственныйЗаДоговор
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестМораторнаяЗадолженностьОбороты.Организация,
	        |	бестМораторнаяЗадолженностьОбороты.Район,
	        |	бестМораторнаяЗадолженностьОбороты.Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Задолженность.Договор КАК Договор,
	        |	СУММА(Задолженность.Сумма) КАК СуммаВсего,
	        |	МАКСИМУМ(Задолженность.КолвоДнейЗадолженности) КАК КолвоДнейЗадолженностиМакс,
	        |	МИНИМУМ(Задолженность.ДатаВозникновенияЗадолженности) КАК ДатаВозникновенияЗадолженностиМин
	        |ПОМЕСТИТЬ МинимальнаяДатаИОбщаяСуммаЗадолженности
	        |ИЗ
	        |	Задолженность КАК Задолженность
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Задолженность.Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	АвансоваяЗадолженность.Договор КАК Договор,
	        |	АвансоваяЗадолженность.Организация КАК Организация,
	        |	АвансоваяЗадолженность.Район КАК Район,
	        |	СУММА(АвансоваяЗадолженность.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ОбщаяСуммаАвансовойЗадолженности
	        |ИЗ
	        |	АвансоваяЗадолженность КАК АвансоваяЗадолженность
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	АвансоваяЗадолженность.Договор,
	        |	АвансоваяЗадолженность.Организация,
	        |	АвансоваяЗадолженность.Район
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	НастройкиПериодовЗадолженности.КатегорияЗадолженности КАК КатегорияЗадолженности,
	        |	НастройкиПериодовЗадолженности.От КАК От,
	        |	НастройкиПериодовЗадолженности.До КАК До
	        |ПОМЕСТИТЬ ВТ_НастройкиПериодовЗадолженности
	        |ИЗ
	        |	НастройкиПериодовЗадолженности КАК НастройкиПериодовЗадолженности
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестНастройкиКатегорийДебитораСрезПоследних.Организация КАК Организация,
	        |	бестНастройкиКатегорийДебитораСрезПоследних.КатегорияДебитора КАК КатегорияДебитора,
	        |	бестНастройкиКатегорийДебитораСрезПоследних.От КАК От,
	        |	бестНастройкиКатегорийДебитораСрезПоследних.До КАК До
	        |ПОМЕСТИТЬ НастройкиКатегорийДебитора
	        |ИЗ
	        |	РегистрСведений.бестНастройкиКатегорийДебитора.СрезПоследних(&Период, Организация = &Организация) КАК бестНастройкиКатегорийДебитораСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Задолженность.Организация КАК Организация,
	        |	Задолженность.Район КАК Район,
	        |	Задолженность.Договор КАК Договор,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ_НастройкиПериодовЗадолженности.КатегорияЗадолженности = ЗНАЧЕНИЕ(Перечисление.бестКатегорииЗадолженности.Неоплаченная)
	        |				ТОГДА Задолженность.Сумма
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК Неоплаченная,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ_НастройкиПериодовЗадолженности.КатегорияЗадолженности = ЗНАЧЕНИЕ(Перечисление.бестКатегорииЗадолженности.Сомнительная)
	        |				ТОГДА Задолженность.Сумма
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК Сомнительная,
	        |	СУММА(ВЫБОР
	        |			КОГДА ВТ_НастройкиПериодовЗадолженности.КатегорияЗадолженности = ЗНАЧЕНИЕ(Перечисление.бестКатегорииЗадолженности.Просроченная)
	        |				ТОГДА Задолженность.Сумма
	        |			ИНАЧЕ 0
	        |		КОНЕЦ) КАК Просроченная
	        |ПОМЕСТИТЬ ДелениеЗадолженности
	        |ИЗ
	        |	Задолженность КАК Задолженность
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НастройкиПериодовЗадолженности КАК ВТ_НастройкиПериодовЗадолженности
	        |		ПО Задолженность.КолвоДнейЗадолженности >= ВТ_НастройкиПериодовЗадолженности.От
	        |			И (ВЫБОР
	        |				КОГДА ВТ_НастройкиПериодовЗадолженности.До = 0
	        |					ТОГДА ИСТИНА
	        |				ИНАЧЕ Задолженность.КолвоДнейЗадолженности < ВТ_НастройкиПериодовЗадолженности.До
	        |			КОНЕЦ)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Задолженность.Организация,
	        |	Задолженность.Район,
	        |	Задолженность.Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестВзаиморасчетыПоПениЭЭОстатки.Организация КАК Организация,
	        |	бестВзаиморасчетыПоПениЭЭОстатки.Район КАК Район,
	        |	бестВзаиморасчетыПоПениЭЭОстатки.Договор КАК Договор,
	        |	СУММА(бестВзаиморасчетыПоПениЭЭОстатки.СуммаОстаток) КАК СуммаОстаток
	        |ПОМЕСТИТЬ Пеня
	        |ИЗ
	        |	РегистрНакопления.бестВзаиморасчетыПоПениЭЭ.Остатки(
	        |			&Период,
	        |			(Организация, Район, Договор) В
	        |				(ВЫБРАТЬ
	        |					Задолженность.Организация КАК Организация,
	        |					Задолженность.Район КАК Район,
	        |					Задолженность.Договор КАК Договор
	        |				ИЗ
	        |					Задолженность КАК Задолженность)) КАК бестВзаиморасчетыПоПениЭЭОстатки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	бестВзаиморасчетыПоПениЭЭОстатки.Организация,
	        |	бестВзаиморасчетыПоПениЭЭОстатки.Район,
	        |	бестВзаиморасчетыПоПениЭЭОстатки.Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Организация КАК Организация,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Район КАК Район,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Договор КАК Договор,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ДеньФормирования КАК ДеньФормирования,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты КАК СрокОплаты,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.Процент КАК Процент,
	        |	бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.ТипОплаты КАК ТипОплаты,
	        |	ВЫБОР
	        |		КОГДА ДЕНЬ(&Период) > бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты
	        |			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 1), ДЕНЬ, бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты - 1)
	        |		ИНАЧЕ ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних.СрокОплаты - 1)
	        |	КОНЕЦ КАК ДатаОплаты
	        |ПОМЕСТИТЬ ДеньОплаты
	        |ИЗ
	        |	РегистрСведений.бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорам.СрезПоследних(
	        |			&Период,
	        |			(Организация, Район, Договор) В
	        |				(ВЫБРАТЬ
	        |					Задолженность.Организация КАК Организация,
	        |					Задолженность.Район КАК Район,
	        |					Задолженность.Договор КАК Договор
	        |				ИЗ
	        |					Задолженность КАК Задолженность)) КАК бестНастройкиСроковИПроцентовОплатыПотребленияПоДоговорамСрезПоследних
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Задолженность.Организация КАК Организация,
	        |	Задолженность.Район КАК Район,
	        |	Задолженность.Договор КАК Договор,
	        |	СУММА(Задолженность.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_ТекущаяЗадолженность
	        |ИЗ
	        |	Задолженность КАК Задолженность
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДеньОплаты КАК ДеньОплаты
	        |		ПО Задолженность.Организация = ДеньОплаты.Организация
	        |			И Задолженность.Район = ДеньОплаты.Район
	        |			И Задолженность.Договор = ДеньОплаты.Договор
	        |			И (РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Задолженность.ДатаВозникновенияЗадолженности, МЕСЯЦ), МЕСЯЦ, 1), ДЕНЬ, ДеньОплаты.СрокОплаты - 1), &Период, ДЕНЬ) <= 0)
	        |			И (ДеньОплаты.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Задолженность.Организация,
	        |	Задолженность.Район,
	        |	Задолженность.Договор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	АвансоваяЗадолженность.Договор КАК Договор,
	        |	АвансоваяЗадолженность.Организация КАК Организация,
	        |	АвансоваяЗадолженность.Район КАК Район,
	        |	СУММА(АвансоваяЗадолженность.Сумма) КАК Сумма
	        |ПОМЕСТИТЬ ТекущаяАвансоваяЗадолженность
	        |ИЗ
	        |	АвансоваяЗадолженность КАК АвансоваяЗадолженность
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДеньОплаты КАК ДеньОплаты
	        |		ПО АвансоваяЗадолженность.Договор = ДеньОплаты.Договор
	        |			И АвансоваяЗадолженность.Организация = ДеньОплаты.Организация
	        |			И АвансоваяЗадолженность.Район = ДеньОплаты.Район
	        |			И АвансоваяЗадолженность.Процент = ДеньОплаты.Процент
	        |			И АвансоваяЗадолженность.ДеньФормирования = ДеньОплаты.ДеньФормирования
	        |			И (ДЕНЬ(&Период) <= ДеньОплаты.СрокОплаты)
	        |			И (ДеньОплаты.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Авансовый))
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	АвансоваяЗадолженность.Договор,
	        |	АвансоваяЗадолженность.Организация,
	        |	АвансоваяЗадолженность.Район
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ДелениеЗадолженности.Организация КАК Организация,
	        |	ДелениеЗадолженности.Район КАК Район,
	        |	ДелениеЗадолженности.Договор КАК Договор
	        |ПОМЕСТИТЬ ДоговорыПоКоторымВедетсяПИР
	        |ИЗ
	        |	ДелениеЗадолженности КАК ДелениеЗадолженности
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
	        |		ПО ДелениеЗадолженности.Организация = энргЗадачаПИД.Организация
	        |			И (энргЗадачаПИД.Район = ДелениеЗадолженности.Район)
	        |			И (энргЗадачаПИД.Договор = ДелениеЗадолженности.Договор)
	        |			И (НЕ энргЗадачаПИД.Выполнена)
	        |			И (НЕ энргЗадачаПИД.ПометкаУдаления)
	        |			И (энргЗадачаПИД.ЗадачаЮЛ)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДеньОплаты.Организация КАК Организация,
	        |	ДеньОплаты.Район КАК Район,
	        |	ДеньОплаты.Договор КАК Договор,
	        |	МИНИМУМ(ДеньОплаты.ДатаОплаты) КАК ДатаОплаты,
	        |	ДеньОплаты.ТипОплаты КАК ТипОплаты
	        |ПОМЕСТИТЬ СледующаяДатаОплаты
	        |ИЗ
	        |	ДеньОплаты КАК ДеньОплаты
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДеньОплаты.Организация,
	        |	ДеньОплаты.Район,
	        |	ДеньОплаты.Договор,
	        |	ДеньОплаты.ТипОплаты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДелениеЗадолженности.Организация КАК Организация,
	        |	ДелениеЗадолженности.Район КАК Район,
	        |	ДелениеЗадолженности.Договор КАК Договор,
	        |	ДелениеЗадолженности.Неоплаченная КАК НеоплаченнаяЗадолженностьСумма,
	        |	ДелениеЗадолженности.Сомнительная КАК СомнительнаяЗадолженностьСумма,
	        |	ДелениеЗадолженности.Просроченная КАК ПросроченнаяЗадолженностьСумма,
	        |	МинимальнаяДатаИОбщаяСуммаЗадолженности.СуммаВсего КАК ОбщаяСуммаЗадолженности,
	        |	НастройкиКатегорийДебитора.КатегорияДебитора КАК КатегорияДебитора,
	        |	Пеня.СуммаОстаток КАК СуммаПени,
	        |	ВЫБОР
	        |		КОГДА НЕ ДеньОплаты.ДеньФормирования ЕСТЬ NULL
	        |			ТОГДА РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(МинимальнаяДатаИОбщаяСуммаЗадолженности.ДатаВозникновенияЗадолженностиМин, МЕСЯЦ), МЕСЯЦ, 1), ДЕНЬ, ДеньОплаты.ДеньФормирования - 1), &Период, ДЕНЬ)
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоДнейПросрочки,
	        |	МинимальнаяДатаИОбщаяСуммаЗадолженности.ДатаВозникновенияЗадолженностиМин КАК ДатаВозникновенияЗадолженности,
	        |	ЕСТЬNULL(ВТ_ТекущаяЗадолженность.Сумма, 0) КАК ТекущаяЗадолженность,
	        |	НЕ ДоговорыПоКоторымВедетсяПИР.Договор ЕСТЬ NULL КАК ВедутсяМероприятияПИР,
	        |	ЕСТЬNULL(МораторнаяЗадолженность.Сумма, 0) КАК МораторнаяЗадолженность,
	        |	ЕСТЬNULL(РеструктуризированнаяЗадолженность.Сумма, 0) КАК РеструктуризированнаяЗадолженность,
	        |	ЕСТЬNULL(СписаннаяЗадолженность.Сумма, 0) КАК БезнадежнаяЗадолженность,
	        |	ЕСТЬNULL(ТекущаяАвансоваяЗадолженность.Сумма, 0) КАК ТекущаяАвансоваяЗадолженность,
	        |	ЕСТЬNULL(ОбщаяСуммаАвансовойЗадолженности.Сумма, 0) КАК ОбщаяАвансоваяЗадолженность,
	        |	СледующаяДатаОплаты.ДатаОплаты КАК ДатаОплатыФакта,
	        |	СледующаяДатаОплаты1.ДатаОплаты КАК ДатаОплатыАванса,
	        |	РАЗНОСТЬДАТ(&Период, ЕСТЬNULL(СледующаяДатаОплаты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) КАК КолвоДнейДоОплатыФ,
	        |	РАЗНОСТЬДАТ(&Период, ЕСТЬNULL(СледующаяДатаОплаты1.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) КАК КолвоДнейДоОплатыА
	        |ИЗ
	        |	ДелениеЗадолженности КАК ДелениеЗадолженности
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальнаяДатаИОбщаяСуммаЗадолженности КАК МинимальнаяДатаИОбщаяСуммаЗадолженности
	        |			ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКатегорийДебитора КАК НастройкиКатегорийДебитора
	        |			ПО МинимальнаяДатаИОбщаяСуммаЗадолженности.КолвоДнейЗадолженностиМакс >= НастройкиКатегорийДебитора.От
	        |				И (ВЫБОР
	        |					КОГДА НастройкиКатегорийДебитора.До = 0
	        |						ТОГДА ИСТИНА
	        |					ИНАЧЕ МинимальнаяДатаИОбщаяСуммаЗадолженности.КолвоДнейЗадолженностиМакс < НастройкиКатегорийДебитора.До
	        |				КОНЕЦ)
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ДеньОплаты КАК ДеньОплаты
	        |			ПО МинимальнаяДатаИОбщаяСуммаЗадолженности.Договор = ДеньОплаты.Договор
	        |				И (ДеньОплаты.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический))
	        |		ПО ДелениеЗадолженности.Договор = МинимальнаяДатаИОбщаяСуммаЗадолженности.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Пеня КАК Пеня
	        |		ПО ДелениеЗадолженности.Договор = Пеня.Договор
	        |			И ДелениеЗадолженности.Организация = Пеня.Организация
	        |			И ДелениеЗадолженности.Район = Пеня.Район
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущаяЗадолженность КАК ВТ_ТекущаяЗадолженность
	        |		ПО ДелениеЗадолженности.Организация = ВТ_ТекущаяЗадолженность.Организация
	        |			И ДелениеЗадолженности.Район = ВТ_ТекущаяЗадолженность.Район
	        |			И ДелениеЗадолженности.Договор = ВТ_ТекущаяЗадолженность.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыПоКоторымВедетсяПИР КАК ДоговорыПоКоторымВедетсяПИР
	        |		ПО ДелениеЗадолженности.Организация = ДоговорыПоКоторымВедетсяПИР.Организация
	        |			И ДелениеЗадолженности.Район = ДоговорыПоКоторымВедетсяПИР.Район
	        |			И ДелениеЗадолженности.Договор = ДоговорыПоКоторымВедетсяПИР.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РеструктуризированнаяЗадолженность КАК РеструктуризированнаяЗадолженность
	        |		ПО ДелениеЗадолженности.Организация = РеструктуризированнаяЗадолженность.Организация
	        |			И ДелениеЗадолженности.Район = РеструктуризированнаяЗадолженность.Район
	        |			И ДелениеЗадолженности.Договор = РеструктуризированнаяЗадолженность.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СписаннаяЗадолженность КАК СписаннаяЗадолженность
	        |		ПО ДелениеЗадолженности.Организация = СписаннаяЗадолженность.Организация
	        |			И ДелениеЗадолженности.Район = СписаннаяЗадолженность.Район
	        |			И ДелениеЗадолженности.Договор = СписаннаяЗадолженность.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ МораторнаяЗадолженность КАК МораторнаяЗадолженность
	        |		ПО ДелениеЗадолженности.Организация = МораторнаяЗадолженность.Организация
	        |			И ДелениеЗадолженности.Район = МораторнаяЗадолженность.Район
	        |			И ДелениеЗадолженности.Договор = МораторнаяЗадолженность.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТекущаяАвансоваяЗадолженность КАК ТекущаяАвансоваяЗадолженность
	        |		ПО ДелениеЗадолженности.Организация = ТекущаяАвансоваяЗадолженность.Организация
	        |			И ДелениеЗадолженности.Район = ТекущаяАвансоваяЗадолженность.Район
	        |			И ДелениеЗадолженности.Договор = ТекущаяАвансоваяЗадолженность.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОбщаяСуммаАвансовойЗадолженности КАК ОбщаяСуммаАвансовойЗадолженности
	        |		ПО ДелениеЗадолженности.Организация = ОбщаяСуммаАвансовойЗадолженности.Организация
	        |			И ДелениеЗадолженности.Район = ОбщаяСуммаАвансовойЗадолженности.Район
	        |			И ДелениеЗадолженности.Договор = ОбщаяСуммаАвансовойЗадолженности.Договор
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СледующаяДатаОплаты КАК СледующаяДатаОплаты
	        |		ПО ДелениеЗадолженности.Организация = СледующаяДатаОплаты.Организация
	        |			И ДелениеЗадолженности.Район = СледующаяДатаОплаты.Район
	        |			И ДелениеЗадолженности.Договор = СледующаяДатаОплаты.Договор
	        |			И (СледующаяДатаОплаты.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.Фактический))
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СледующаяДатаОплаты КАК СледующаяДатаОплаты1
	        |		ПО ДелениеЗадолженности.Организация = СледующаяДатаОплаты1.Организация
	        |			И ДелениеЗадолженности.Район = СледующаяДатаОплаты1.Район
	        |			И ДелениеЗадолженности.Договор = СледующаяДатаОплаты1.Договор
	        |			И (СледующаяДатаОплаты1.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.бестВидыРасчета.авансовый))
	        |ГДЕ
	        |	НастройкиКатегорийДебитора.КатегорияДебитора = &КатегорияДебитора
	        |	И Пеня.СуммаОстаток >= &МинимальнаяСуммаЗадолженностиПени
	        |	И МинимальнаяДатаИОбщаяСуммаЗадолженности.СуммаВсего >= &МинимальнаяСуммаЗадолженности
	        |	И МинимальнаяДатаИОбщаяСуммаЗадолженности.КолвоДнейЗадолженностиМакс >= &КоличествоДнейЗадолженности
	        |	И ЕСТЬNULL(ВТ_ТекущаяЗадолженность.Сумма, 0) > 0
	        |	И ЕСТЬNULL(СледующаяДатаОплаты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = &КолвоДнейДоОплатыФ
	        |	И ЕСТЬNULL(СледующаяДатаОплаты.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = &КолвоДнейДоОплатыА";
	
КонецФункции

#КонецОбласти

#КонецЕсли
